Repository: 84000/data-translation-memory
Catalog: Toh_308-Questions_Regarding_Death_and_Transmigration-v2.tmx
Source language: bo
Languages: en

source: དྲི་ཟ་ལས་མ་གཏོགས་པ་གཞན་ཡང་གནོད་སྦྱིན་དང་། ཤ་ཟ་དང་། འབྱུང་པོ་ལ་སོགས་པས་ཚེ་འཕོས་པའི་ཕའམ། བུའམ། སྤུན་ལ་སོགས་པ་བསླུ་བའི་ཕྱིར་མི་མ་ཡིན་པ་
en: Not only gandharvas, but other spirits, such as yakṣas, piśācas, and bhūtas, also seek to trick the deceased person’s father, sons, relatives, and so forth.

source: དེས་འཇིག་རྟེན་པའི་རྫུ་འཕྲུལ་གྱིས་ཚེ་འཕོས་པའི་གཏན་ཚིགས་དང་། ས་མལ་དང་། ལོ་རྒྱུས་དག་ཤེས་པར་བྱས་ནས་མི་མ་ཡིན་པ་དེའི་བྱིན་གྱིས་ཕ་མ་ལ་སོགས་པས་མཐོང་བ་དང་། རྨི་ལམ་དུ་འབྱུང་བ་ཡང་ཡོད་དོ། །
en: Thus these demons use their worldly magical powers to know the distinctive signs, final resting place, and the history of the deceased individual, and then they use their demonic influence so that parents and others see and dream of that individual.

source: སྤད་དང་སྤུན་ལ་སོགས་པ་ཡུན་རིང་པོར་ལྷན་ཅིག་པའི་བག་ཆགས་རྟས་པས་མཐོང་བ་དང་རྨི་ལམ་དུ་སྣང་བ་ཡང་ཡོད་དེ།
en: It is due also to the maturation of habitual tendencies stemming from longstanding association that one sees children and relatives and that they appear in dreams.

source: དཔེར་ན་མི་ཞིག་གིས་ད་ལྟར་ཚེ་མ་འཕོས་པའི་རང་གི་ཕ་མའམ། སྤུན་ཟླའམ། བྲན་ཁོལ་ལམ། གཞན་སུ་ཡང་རུང་བ་དག་དང་འགྲོགས་པ་དང་། ལོངས་སྤྱོད་ཀྱི་བདེ་བའམ། དགྲ་རྐུན་དང་། འཐབ་རྩོད་ལ་སོགས་པ་བདེ་བ་དང་། སྡུག་བསྔལ་གང་ཡང་རུང་བདག་རྨིས་ན་
en: Suppose, for example, that a person dreamed of their own presently undeceased parents, relatives, servants, or any others who might befriend them, and as well dreamed of their pleasures coming from various enjoyments, or their pleasures and pains from grappling with enemies or thieves.

source: མི་དེས་རྨིས་པ་བཞིན་དུ་གང་རྨིས་པའི་ཕ་མའམ། སྤུན་ཟླའམ། བྲན་ཁོལ་ལམ་གཞན་སུ་ཡང་རུང་བ་རྨི་ལམ་ན་སྣང་བ་དེས་ཚོར་བ་ཡོད་ན་ནི་རྨིས་པ་དེ་བདེན་པ་ཡིན་ན་
en: If the parents, relatives, and servants they dreamed of, or any others appearing in their dream, actually were to have the feelings in question, just as that person dreamed they did, then that of which they dreamed would have been real.

source: དེས་རྨིས་པའི་ཕ་མའམ། སྤུན་ཟླའམ། བྲན་ཁོལ་ལམ། གཞན་སུ་ཡང་རུང་བ་རྨི་ལམ་ན་སྣང་བ་དེ་བདེན་པར་ཇི་ལྟར་བཟུང་།
en: But how could the parents, relatives, and servants they dreamed of, or any others appearing in their dream, ever be thought to be real?

source: ཀྱེ་རྒྱལ་པོ་ཆེན་པོ་ཚེ་མ་འཕོས་པ་ཡང་གཅིག་གིས་རྨིས་པ་གཅིག་གིས་མི་ཚོར་ན་
en: O Great King, even among living people, that which one person dreams is never felt by another.

source: ཚེ་འཕོས་པའི་རྨིས་པ་ཚེ་འཕོས་པ་དེ་ཡིན་པར་ག་ལ་འགྱུར་ཏེ་
en: Then how could what is dreamed concerning a deceased person ever be that deceased person?

source: བག་ཆགས་རྟས་པ་ཡིན་ནོ། །
en: What is involved is the maturation of habitual tendencies.

source: ཀྱེ་རྒྱལ་པོ་ཆེན་པོ་བག་ཆགས་ལགས་པའི་དཔེ་ནི་གཞན་ཡང་མཆིས་ཏེ།
en: “O Great King, there is yet another analogy for this being a matter of habitual tendencies.

source: མི་ཞིག་སྔོན་ཚེ་སྟོད་ལ་མཆིས་པའི་མཁར་དང་། ཁང་པ་དང་། གྲོང་གང་ཡིན་པ་ཞིག་བོར་ཏེ། ཡུལ་གཞན་ཞིག་ཏུ་ཚེ་སྨད་ལ་འདུག་པ་ན་སྔོན་གྱི་གྲོང་དེ་ཡང་ཞིག་སྟེ།
en: Suppose that a person left whatever castles, houses, and cities they had been in during an earlier part of their life, and that in the later part of their life, when they lived elsewhere, the city they knew previously was destroyed.

source: !སྔོན་མི་འདྲ་བ་ལས་མི་དེས་སྔོན་གྱི་ཁང་པའི་དབྱིབས་དང་རྒྱ་ཅི་འདྲ་བ་མ་ཞིག་པ། མ་འདྲ་མས་པ་རྨིས་ན་
en: This person dreams of the shape and size of their house as they were when it was neither destroyed nor scattered about, no different from before.

source: གྲོང་དང་ཁང་པ་དེ་ལ་སེམས་ཡོད་ན་ནི་ཁང་པ་དེའི་སེམས་སྣང་དུ་རུང་ན་
en: If the city and the house were to have mental natures, then the mental nature of that house might have actually appeared to them.

source: ཁང་པ་དང་གྲོང་དེས་རྡོ་བེམས་པོ་ཡིན་ན་མི་དེས་རྨིས་པ་དེ་ཅིའི་ཕྱིར་བག་ཆགས་རྟས་པ་མ་ཡིན།
en: But since their house and city are earth and stone, then why would what that person dreamed not be a maturation of their habitual tendencies?

source: དེ་བཞིན་དུ་ཚེ་འཕོས་པའི་དན་རྟགས་དང་བཅས་པ་ཡང་ཁང་པ་མ་ཞིག་པ་རྨིས་པ་དང་འདྲ་སྟེ།
en: Likewise, that which has the distinctive signs of a now deceased person is comparable to the undestroyed house of one’s dreams.

source: ཚེ་འཕོས་པའི་སེམས་ཀྱང་ལས་གར་འཐུན་པར་སྐྱེ་བ་བླངས་ཟིན་ན་དེ་སྣད་དུ་བཏུབ་བམ།
en: And if the deceased individual’s mind too had already taken rebirth in accordance with their previous actions, then could they actually appear to anyone?

source: ཀྱེ་རྒྱལ་པོ་ཆེན་པོ་དེའི་ཕྱིར་བག་ཆགས་མཐུ་རྟས་པའི་དབང་གིས་ཚེ་འཕོས་པའི་གཏན་ཚིགས་དང་། ཆ་ལུགས་མཐོང་བ་དང་རྨིས་པ་ཡིན་ནོ། །
en: We conclude, O Great King, that it is through the maturation of habitual tendencies that people see and dream of distinctive signs and styles of dress of now deceased individuals.

source: དེ་བཞིན་དུ་རལ་གྲི་ལ་སོགས་པའི་གོ་མཚོན་ཐོགས་པ་དང་། གོས་དང་། རྒྱན་ལ་སོགས་པ་གྱོན་པ་དང་། རྟ་དང་། གླང་པོ་ཆེ་ལ་སོགས་པ་ཞོན་པར་སྣང་བ་དང་རྨི་ལམ་དུ་འབྱུང་བ་ཡང་བག་ཆགས་སྣང་བ་ཡིན་ཏེ
en: Likewise, the appearances and occurrences in dreams of the deceased holding swords and other weapons, wearing clothes and other ornaments, and riding their horses and elephants, and so forth are also just appearances due to habitual tendencies.

source: ཁང་པའི་དཔེ་བཞིན་དུ་རིག་པར་བྱའོ། །
en: You should understand them along the lines of the analogy of the house.

source: ཀྱེ་རྒྱལ་པོ་ཆེན་པོ་རྒྱལ་པོ་ཆེན་པོས་འདི་ནས་ཤི་འཕོས་པ་ལ་ཕ་མའམ། སྤུན་ནམ། བུ་ལ་སོགས་པ་ཉེ་རིས་རྣམས་ཀྱིས་བཟའ་བ་དང་། བཏུང་བ་ཉུང་ངུ་ཉུང་ངུར་གཏད་པ་དང་། བསྔོས་པ་ཡང་བསྐུལ་པ་མང་པོའི་བར་དུ་ཟད་པར་མི་འགྱུར་བར་ཟ་ཞིང་འཐུང་ངོ་ཞེས་འཇིག་རྟེན་པ་དག་མཆིས་ན་དེ་ལྟར་ལགས་སམ། ཞེས་གསུངས་པ་ནི་
en: “O Great King, you asked whether it is as the worldly say it is. You asked whether those who have passed on from this world can eat and drink inexhaustibly for many eons the small portions of food and drink given and dedicated to them by their parents, siblings and cousins, children, and other relatives.

source: ཀྱེ་རྒྱལ་པོ་ཆེན་པོ་གླིང་བཞི་པ་ནས་སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་དང་། སྟོང་གཉིས་པ་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དང་། འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་པ་དཔག་ཏུ་མེད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ཐམས་ཅད་ན་བཟའ་བ་དང་བཏུང་བ་ཉུང་ངུ་ཉུང་ངུས་དུས་ཐམས་ཅད་དང་། བསྐལ་པ་མང་པོར་ཟ་བའི་སེམས་ཅན་གཟིགས་སམ།
en: O Great King, anywhere, be it on the four continents, in the chiliocosms, the dichiliocosms, the trichiliocosms, or in the limitless, unfathomable, unimaginable world systems, have you ever seen a sentient being who consumes one small portion of food and drink all the time and over many eons?

source: གསན་ནམ།
en: Have you ever heard of such a sentient being?

source: ཀྱེ་རྒྱལ་པོ་ཆེན་པོ་ཡིད་བཞིན་གྱི་ནོར་བུ་རིན་པོ་ཆེ་ལ་ཅི་བསམས་པའི་འདོད་པ་འབྱུང་བ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ལ་ཡོད་པ་ཡང་སྔོན་བསྐལ་པ་མང་པོར་བསོད་ནམས་ཀྱི་ཚོགས་ཚད་མེད་པས་བསགས་པ་ལས་བྱུང་བ་ཡིན་ཏེགནམ་ནས་བབས་པ་དང་།
en: O Great King, though the Cakravartin king has a wish-fulfilling gem that gives whatever he might wish, it came to exist because of immeasurable collections of merit collected earlier over numerous eons—it did not fall from the sky or emerge accidentally.

source: གློ་བུར་དུ་བྱུང་བ་ནི་མ་ཡིན་ན་བཟའ་བ་དང་བཏུང་བ་ཉུང་ངུ་དེ་བསྐལ་པ་མཐའི་བར་དུ་མི་ཟད་པ་དེ་རིགས་ལགས་སམ།
en: Is it then reasonable that this small portion of food and drink would remain unexpended until the end of the eon?

source: ཀྱེ་རྒྱལ་པོ་ཆེན་པོ་ཚེ་མ་འཕོས་པའི་ཕ་སྤད་དང་། སྤུན་གཅིག་ལ་གཅིག་འབྲེལ་པར་འཛིན་པ་ཕན་པར་འདོད་པ་རྣམས་ད་ལྟར་མ་ཤི་བ་ལུས་དང་ལྡན་པ་ཡང་
en: “O Great King, suppose that some living parents, children, siblings, and cousins, who have a mutual relationship and wish to be of benefit to one another, have not yet died and are still physically embodied.

source: གཅིག་ཡུལ་གཞན་དུ་སོང་ན་
en: And suppose one of them went off to another country.

source: དེ་ལ་ཕ་མའམ། བུའམ། སྤུན་གང་ཡང་རུང་བས་ཟས་སྐོམ་མང་པོར་སྦྱིན་ནོ་གསོལ་ལོ་ཞེས་བསྔོས་པ་ཡང་ཡུལ་གཞན་དུ་སོང་བའི་རྨི་ལམ་དུ་ཡང་མི་འབྱུང་ན་དངོས་པོར་ཟ་ཞིང་འཐུང་བ་ལྟ་ག་ལ་ཡོད།
en: Although any of the parents, children, siblings, or cousins might resolve to give and offer a lot of food and drink to that person, none of that would appear to the person who had gone off to the other country, even in their dreams—let alone food and drink in reality.

source: ཚེ་འཕོས་ནས་ལུས་དང་བྲལ་བ་ལ་བསྔོས་ཞིང་གཏད་པ་ཟ་ཞིང་འཐུང་བ་ལྟ་ག་ལ་ཡོད།
en: So why even mention food and drink dedicated to people who have died and have no body?

source: ཀྱེ་རྒྱལ་པོ་ཆེན་པོ་ཚེ་འཕོས་ནས་སེམས་ལུས་དང་བྲལ་བ་དེས་བུ་དང་སྤུན་ལ་སོགས་པས་གཏད་པའི་ཟས་དང་། སྐོམ་དངོས་པོ་ཅན་འདི་དག་སེམས་དངོས་པོ་མེད་པ་གཟུགས་མེད་པས་ཇི་ལྟར་བདག་པོ་བྱེད་པར་འགྱུར།
en: O Great King, how would those people, whose minds have separated from their bodies after death, use their immaterial and formless minds to take possession of the real items of food and drink provided to them by their children, siblings, and the like?

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why would this be a problem?

source: བཟའ་བ་དང་བཅའ་བ་ནི་ལུས་ཡོད་པའི་ཡན་ལག་གི་རྩོལ་བ་ལ་རག་ལུས་ན་
en: The answer is that eating and chewing depend on the workings of body parts.

source: སེམས་ལ་ལུས་ཀྱི་ཡན་ལག་དེའི་རྩོལ་བ་ཡོད་དམ།
en: In that case, are the workings of the parts of the body to be found present in the mind?”

source: རྒྱལ་པོ་ཆེན་པོས་གསོལ་པ།
en: The Great King then asked,

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་ལགས་ན་ཚེ་འཕོས་པ་ལ་འདི་ན་ཕན་འདོགས་པའི་བཟའ་བཏུང་དང་། བཞོན་པ་དང་། གོས་དང་། རྒྱན་གཏོང་བ་འདི་དག་ལ་དོན་མ་མཆིས་པ་ལགས་སམ།
en: “Blessed One, if that is the case, then is it useless to offer deceased individuals the food, drink, mounts, clothes, and ornaments that were beneficial to them in the present world?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One replied,

source: རྒྱལ་པོ་ཆེན་པོ་ཚེ་འཕོས་པ་དེས་ལས་གང་སྤྱད་པའི་རྣམ་པར་སྨིན་པས་འགྲོ་བ་རིས་ཐ་དད་པ་གང་དུ་སྐྱེ་བ་ལེན་པ་དེ་ལ་
en: “O Great King, take the case where a deceased person is being reborn in one of various different states of being because actions he had done are ripening.

source: མི་དགེ་བ་དང་མ་འབྲེལ་པའི་བསོད་ནམས་ཀྱི་ཚོགས་སུ་འགྱུར་བའི་ལས་དགེ་བ་སྣ་ཚོགས་པས་བསྟངས་ན་
en: And suppose people help that person by [dedicating to him] all sorts of virtuous actions that will constitute a collection of merit without any nonvirtue.

source: མཐོ་རིས་དང་ཐར་པར་ཡང་སྐྱེ་ལ།
en: In that case, the person will be reborn in higher states, or attain liberation.

source: གལ་ཏེ་སྐྱེ་བ་བླངས་པ་ཞིག་ལ་བསོད་ནམས་སུ་འགྱུར་བའི་ལས་དགེ་བ་ཞིག་གིས་བསྟངས་ན་
en: On the other hand, when someone has already taken rebirth, then if one aids him through [the dedication of] a virtuous action that constitutes merit,

source: སྐྱེ་བ་བླངས་པ་དེས་ནོར་རྙེད་པ་དང་། ལོ་ལེགས་པ་དང་། འདོད་པའི་ལོངས་སྤྱོད་འཕེལ་བ་དང་། འགྲོ་བ་གཞན་ཐམས་ཅད་ཀྱིས་མཆོད་ཅིང་བཀུར་བར་འགྱུར་བའི་ཕན་པ་ཡོད་ཀྱི།
en: that will aid the already reborn person to gain wealth, have good crops, more and more of the pleasures he wishes, as well as honor and respect from all his other fellow beings.

source: ཚེ་འཕོས་པ་སྐྱེ་བ་མི་ལེན་པར་གཤིན་གྱི་འཇིག་རྟེན་ཡོད་ནས་བཟའ་བཏུང་དང་། བཞོན་པ་དང་། གོས་དང་། རྒྱན་དག་བདག་པོར་བྱེད་པ་མ་ཡིན་ནོ། །
en: However, it is not so that the deceased individual stays on in the ‘world of Death,’ without rebirth, and taking on food and drink, mounts, clothing, and ornaments.

source: ཀྱེ་རྒྱལ་པོ་ཆེན་པོ་འཇིག་རྟེན་པ་དག་གང་གིས་མཐོང་བ་དང་། ཕ་མ་ལ་སོགས་པས་རྨི་ལམ་དུ་རྨིས་ཏེ། ཚེ་འཕོས་པ་ལས་བསྔོས་པས་གཤིན་དེ་བཟའ་བཏུང་གིས་མགུའོ། །བཞོན་པ་ཞོན་ནོ། །གོས་གྱོན་ནོ། །རྒྱན་ཐོགས་སོ། །
en: “O Great King, suppose people say that things seen by the worldly and dreamed of by parents and others are dedicated to the deceased, and that consequently the dead person is satisfied with the food and drink, rides the mounts, and wears the clothes and ornaments.

source: !ཞེས་སྨྲ་ཞིང་དེ་ལྟར་སྣང་བ་དེ་ཡང་བཟའ་བཏུང་གིས་མི་མགུའོ། །བཞོན་པ་མེད་དོ། །གོས་མི་གྱོན་ནོ། །རྒྱན་མི་ཐོགས་སོ། །ཞེས་སྨྲ་ཞིང་དེ་ལྟར་སྣང་བ་དག་དྲི་ཟ་འཆི་ཀའི་སེམས་ལ་ཉེ་བར་འཇུག་པ་དང་། མི་མ་ཡིན་པ་དག་གིས་དེ་ལྟར་སྣང་བར་བྱེད་པ་ཡོད་དོ། །
en: While this might appear to be so, there are demons and gandharvas who prey upon the minds of those on the verge of death, and who make such apparitions manifest in that way and [make them seem to be] saying they are unsatisfied with the food and drink, do not have the mounts, and do not wear the clothes and ornaments.

source: ཀྱེ་རྒྱལ་པོ་ཆེན་པོ་རྒྱལ་པོ་ཆེན་པོས་སེམས་ཅན་དག་འདི་ནས་ཚེ་འཕོ་ཁ་ན་ཕ་མའམ། སྤུན་ནམ། བུ་ལ་སོགས་པ་ལ་གཏམ་བྱས་པ་དང་། ཚིག་ཅི་སྨྲས་པ་དང་། གཟུགས་ཅི་འདྲ་བ་དག་དེ་ཚེ་འཕོས་ནས་ཕྱིས་ཕ་མ་དང་། སྤུན་ནམ། བུ་ལ་སོགས་པ་ལ་དེ་སྔོན་ཚེ་མ་འཕོས་པའི་དུས་ན་གཏམ་བྱས་པ་ལ་སོགས་པ་སྨྲ་བ་དང་གཟུགས་བྱད་སྟོན་ཏེདེ་ལྟ་བུ་མཐོང་བ་དང་སྟོན་པ་ཡོད་ཅེས་
en: “O Great King, the worldly say the following: whatever words sentient beings say and stories they tell, and whatever physical features they exhibit to their parents, siblings, and so forth when on the verge of death, later, after death, they will tell the same stories and so forth to their parents, siblings, and children that they had told earlier before they died, and they will exhibit the same physical features to them later as they had earlier before their death—such visions and exhibitions supposedly exist.

source: འཇིག་རྟེན་པ་དག་མཆི་ན། དེ་ལྟར་ལགས་སམ་མ་ལགས་ཞེས་གསུངས་པ་ནི།
en: The Great King has asked whether what the worldly say is true or not.

source: ཀྱེ་རྒྱལ་པོ་ཆེན་པོ་སྨྲ་བ་ནི་
en: “O Great King, take the case of speech.

source: ལུས་ཡོད་པའི་ཁ་ལྕེ་ལ་བརྟེན་ནས་
en: Speech depends upon the vocal tract of an embodied person.

source: སྨྲ་བ་ལགས་ན་ཚེ་འཕོས་པའི་ལུས་ནི་འདིར་བཞག་ན་སེམས་གཟུགས་མེད་པ་དེ་ཇི་ལྟར་སྨྲ།
en: So then, if the body of the dead person is left behind in this world, how could their incorporeal mind ever speak?

source: དེ་སྟེ་ཤི་བ་དེ་ལ་ལུས་ཡོད་དོ། །ཞེས་ཟེར་བ་ནི་སྐྱེ་བ་བླངས་པ་ཡིན་ཏེ། དེ་ལ་ཕ་མ་དགོས་པས་
en: Now, when we say that a dead person has a body, we mean that they have taken rebirth, for which parents were required.

source: གཤིན་གྱི་འཇིག་རྟེན་ཡང་མེད་དོ། །
en: So there is no ‘world of Death’ either.

source: ཀྱེ་རྒྱལ་པོ་ཆེན་པོ་དེ་ལྟ་བུའི་ཚེ་མ་འཕོས་པའི་མཚན་མ་དང་དན་རྟགས་འཇིག་རྟེན་པ་གང་དག་སྨྲ་བ་ནི་དྲི་ཟ་ཁྱབ་བྱེད་ཅེས་བྱ་བའི་རིགས་ཡོད་པས་བྱེད་དེ།
en: “O Great King, what the worldly call characteristics and distinctive signs of the living are things fabricated by a type of gandharva called the pervader .

source: དཔེར་ན་རླུང་ཆེན་པོས་ཐང་དང་ཀླུང་ཡངས་པ་དག་ཏུ་དུས་གཅིག་ཏུ་རླུང་ལྡང་བ་བཞིན་དུ་འཆི་འཕོ་བ་ཐམས་ཅད་ཀྱི་སེམས་ལ་ཁྱབ་པར་བྱེད་པའི་རིགས་དྲི་ཟ་བི་ཙ་ན་ཞེས་བྱ་བ་དང་། གནོད་སྦྱིན་སྨྲ་འདོད་ཀྱི་རིགས་དང་། འབྱུང་པོ་བར་ཧི་ནི་ཏ་ཀུན་ཏུ་རྟོགས་འདོད་ཅེས་བྱ་བ་དག་གིས་
en: The so-called vicana sorts of gandharvas, the talkative sorts of yakṣas, and the inquisitive bar hi ni ta sorts of bhūtas pervade the minds of all the dying, just like a strong wind that instantly blows over the wide plains and waters.

source: བསྒྲུབས་ནས་
en: They conjure up such things.

source: མི་མ་ཡིན་པ་དེ་དག་གིས་ཤི་བ་དེས་སྔོན་ཇི་ལྟར་གཏམ་བྱས་པ་དང་། ཆ་ལུགས་ཀྱི་དན་རྟགས་དག་འཇིག་རྟེན་པ་དག་བསླུ་བའི་ཕྱིར་སྟོན་ཅིང་སྨྲ་བ་དག་ཡིན་ནོ། །
en: And then, in order to trick the worldly, these demons tell stories in the same way the deceased people used to do earlier, and exhibit their characteristic styles of dress.”

source: དེའི་ཚེ་ལྷ་སྦྱིན་དེ་ན་འདུག་པས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་གསུངས་པ་དེ་ལ་ཡིད་མ་ཆེས་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: At that time Devadatta was present and, not believing what the Blessed One had said, he questioned him:

source: གཽ་ཏ་མ་སེམས་ཅན་ཚེ་འཕོས་ནས་ཅིར་འགྱུར་བའི་དན་རྟགས་ཕ་རོལ་ན་ཡོད་པ་དང་མེད་པ་བཀའ་སྩལ་པ།
en: “Gautama, you have explained whatever distinctive signs there are, or are not, in the afterlife that follows death.

source: དེ་གཽ་ཏ་མས་ཐོག་མ་སུ་ལ་གསན།
en: From whom did you first hear about them, Gautama?

source: དུས་ནམ་གྱི་ཚེ་མཁྱེན་པར་མཛད།
en: When did you come to know about them?

source: གསན་པ་དང་མཁྱེན་པར་མཛད་པའི་གྲོགས་པོ་ནི་སུ་ལགས།
en: Who heard and knew about them along with you?”

source: ལྷ་སྦྱིན་ངས་ནི་རང་གི་ལུས་བཏང་བ་ལ་སོགས་པ་དཀའ་བ་མང་པོ་དག་བསྐལ་པ་གྲངས་མེད་པར་སྤྱད་དེ་
en: “Devadatta, for countless eons I practiced numerous sorts of austerities, such as sacrificing my body;

source: སྒྲིབ་པ་ཐམས་ཅད་ནི་སྦྱངས། ཚོགས་ཆེན་པོ་ཡང་དག་པར་བསགས་པས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཐོབ་སྟེ།
en: I purified all obstructions, perfectly accumulated a great collection of merit, and thus attained omniscient wisdom.

source: འདས་པའི་དུས་ན་སྔོན་བྱུང་བ་དང་། ད་ལྟར་གྱི་དུས་ན་ཕྱོགས་བཅུ་མཐའ་ཡས་པ་ན་ཤེས་བྱ་གང་དག་ཅི་ཡོད་པ་དང་། མ་འོངས་པའི་དུས་ན་འབྱུང་བར་འགྱུར་བའི་ཤེས་བྱ་ཐམས་ཅད་ལ་མི་མཁྱེན་པར་གྱུར་པ་གང་ཡང་མེད་དེ
en: There is nothing I do not know concerning any knowable matter before me in the past or in the limitless ten directions in the present, or concerning all knowable matters that will occur in the future.

source: དཔེར་ན་འཛམ་བུའི་གླིང་འདིར་ཉི་མ་ཤར་བ་དེ་ཁད་དང་རིམ་གྱིས་ཤར་བ་མ་ཡིན་ཏེ། དུས་གཅིག་ཏུ་གསལ་བར་ཤར་བ་བཞིན་དུ་ཤེས་བྱ་ཐམས་ཅད་སྐད་ཅིག་མ་གཅིག་ལ་མཁྱེན་པའི་ཕྱིར་
en: “Just as when the sun shines here in Jambudvīpa, it does not shine over things gradually or in stages, but shines clearly all at once, so too I know, in one instant, everything that can be known.

source: ང་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་མངའ་བ་ཞེས་བྱའོ། །
en: And thus it is said that I possess the exalted wisdom that knows all aspects.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་ལ་ཡང་ལྷ་སྦྱིན་ཡིད་མ་ཆེས་ནས་
en: Devadatta did not believe in these sorts of statements either.

source: ཐམས་ཅད་མཁྱེན་པ་མངའ་བ་དེ་ཉམས་སད་པའི་ཕྱིར་འཛམ་བུ་གླིང་འདི་ན་ཤིང་གི་རིགས་ཙན་དན་དང་། བླག་ཤ་དང་། སེང་ལྡེང་ལ་སོགས་པ་ཤིང་ཐ་དད་པ་བརྒྱ་སྟོང་བྱེ་བ་དག་བཅད་དེ
en: In order to test whether the Blessed One actually did possess omniscience, he cut samples of a vast number of different sorts of wood, that is, of all the types of trees here on Jambudvīpa, including sandalwood, waved-leaf fig trees, catechu, and so forth.

source: སོ་སོར་བསྲེགས་ནས་ཐལ་བའི་ཕུར་མ་བྱས་ནས་
en: He burnt them and made small bags for the ashes of each one.

source: རང་གིས་མི་ནོར་བར་བྱ་བའི་ཕྱིར་ཐལ་བ་ལ་ཤིང་གང་དང་གང་གི་མིང་ཡི་གེར་བཏགས་ཏེ།
en: So as not to be mistaken about which type of wood each bag of ash came from, he labelled each bag of ash with the appropriate name.

source: བཅོམ་ལྡན་འདས་ཀྱི་དྲུང་དུ་སོང་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: He then went to the Blessed One and asked,

source: བཅོམ་ལྡན་འདས་ཁྱོད་ལ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་མངའ་ན། འདི་ཤིང་གང་གི་ཐལ་བ་འདི་ཤིང་གང་གི་ཐལ་བ་ལགས་ཞེས་
en: “Blessed One , if you possess omniscient wisdom, then which bag of ash belongs to which tree?”

source: མཐར་ཆགས་སུ་ཐལ་བའི་ཕུར་མ་ཐམས་ཅད་བསྟན་པ་ལས་
en: And he showed him the small bags of ashes one by one.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཤིང་གང་གི་ཐལ་བ་ཡིན་པ་མ་ནོར་བར་འདི་ནི་ཙན་དན་གྱི་ཐལ་བའོ། །འདི་ནི་བླག་ཤའི་ཐལ་བའོ། །འདི་ནི་སེང་ལྡེང་གི་ཐལ་བའོ། །ཞེས་ཐལ་བའི་ཕུར་མ་ཐམས་ཅད་མ་ནོར་བར་བཤད་པ་ལས།
en: For each small bag, the Blessed One explained unmistakenly which tree the ash had come from, saying, “This one is sandalwood ash. This one is waved-leaf fig tree ash. This one is catechu ash,” and so forth.

source: ལྷ་སྦྱིན་བཅོམ་ལྡན་འདས་ལ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་མངའ་བར་ཡིད་ཆེས་པར་གྱུར་ཏེ།
en: Devadatta thus came to believe that the Blessed One really did have omniscient wisdom.

source: ཚེ་འཕོས་པ་ཅིར་འགྱུར་བར་གསུངས་པ་བདེན་པར་བསམས་ནས།
en: Thinking that the Blessed One’s pronouncements on death were all true,

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་བསྟོད་དོ། །
en: he praised him in the following terms:

source: བཅོམ་ལྡན་འདས་ནི་ཀུན་མཁྱེན་ལགས། །
en: “The Blessed One is omniscient;

source: ཤིང་མང་ཐལ་བའི་བྱེ་བྲག་རྣམས། །མ་གཟིགས་མ་གསན་ངེས་པར་མཁྱེན། །ཚེ་འཕོས་ཅི་འགྱུར་གསུངས་པ་ངེས། །
en: What he has said about death must be true. Without previously seeing them or hearing of them, He recognizes these different varieties of ashes of wood.”

source: ཞེས་བསྟོད་ནས་སྤོབས་པ་མེད་པར་གྱུར་ཏོ། །
en: He thus praised him and was left at a loss for words.

source: དེའི་ཚེ་ཤཱཀྱ་མིང་ཆེན་དེ་ན་འདུག་པས་
en: At that time the Śākya Mahānāman was present, too.

source: ཚེ་འཕོས་པ་ཅིར་འགྱུར་བཀའ་སྩལ་པ་ལ་ཡིད་མ་ཆེས་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Not believing what the Blessed One had said about death, he asked,

source: བཅོམ་ལྡན་འདས་ཚེ་འཕོས་པའི་སེམས་ཅན་རྣམས་ཅིར་འགྱུར་བ་གསུངས་པ་དེ་མངོན་སུམ་དུ་གཟིགས་སམ་འོན་ཏེ་གཞན་ཞིག་ལ་གསན་པ་ལགས། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: “Blessed One, did you directly perceive what you have explained about the death of beings, or did you hear it from someone else?”

source: མིང་ཆེན་ངའི་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་མི་གཟིགས་པ་ནི་འཇིག་རྟེན་ན་མེད་དེ
en: “Mahānāman, there is nothing in the world that my buddha-eye does not see.

source: སྐྱུ་རུ་ར་རློན་པ་ལག་མཐིལ་དུ་བཞག་ན་ལག་པའི་བྱེ་བྲག་ཐམས་ཅད་གསལ་བ་
en: When a fresh gooseberry is placed in the palm of the hand, all the features of the hand are conspicuous in it.

source: དེ་བཞིན་དུ་དུས་གསུམ་གྱི་ཤེས་བྱ་ལ་ངས་མ་གཟིགས་པ་ཅི་ཡང་མི་མངའ་སྟེ།
en: Likewise, there is no knowable thing whatsoever in the three times that I do not see.

source: ཐོས་པ་ལ་བརྟེན་པ་ནི་མ་ཡིན་ནོ། །
en: I do not base myself on hearsay.”

source: ཤཱཀྱ་མིང་ཆེན་གྱིས་ཐམས་ཅད་གཟིགས་པ་དེ་བདེན་བརྫུན་ཉམས་སད་པའི་ཕྱིར་སེར་སྐྱའི་གྲོང་ཁྱེར་ཆེན་པོར་སོང་སྟེ།
en: In order to test whether the Buddha was truly omniscient or not, Śākya Mahānāman then went to the great city of Kapilavastu.

source: ཁྱིམ་ཇི་སྙེད་ཡོད་པ་ལ་འབྲས་ཀྱི་ཕུར་མ་རེ་རེ་བླངས་ཏེ། རང་གིས་འབྲས་ཀྱི་ཕུར་མ་མི་གང་ལ་བླངས་པ་མི་ནོར་བར་བྱ་བའི་ཕྱིར་ཤཱཀྱ་གང་ལ་བླངས་པའི་མིང་རྣམས་བྲིས་ཏེ། འབྲས་ཕུར་མའི་ནང་དུ་བཅུག་ནས་
en: From each household, he took a small bag of rice, and so that he would not mistake whose rice was whose, he wrote down the name of every Śākya he took them from and put these names inside the small bags.

source: འབྲས་ཀྱི་ཕུར་མ་གླང་པོ་ཆེའི་ཁལ་ལོངས་པ་ཅིག་དང་། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་སོང་སྟེ་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: When the rice bags came to be a full load for an elephant, he went to the Blessed One and requested of him,

source: བཅོམ་ལྡན་འདས་བཅོམ་ལྡན་འདས་ཀྱིས་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་ཐམས་ཅད་གཟིགས་ན་འབྲས་ཀྱི་ཕུར་མ་འདི་དག་མི་དབྱེ་བར་ཤཱཀྱ་གང་གང་གི་འབྲས་གང་གང་ལགས་པ་མཁྱེན་པར་མཛོད་ཅིག་ཅེས་གསོལ་ནས
en: “Blessed One, if your buddha-eye sees all, then please recognize, without opening them, which Śākyas’ small bags of rice are which.”

source: གླང་པོ་ཆེའི་ཁལ་གྱི་འབྲས་ཀྱི་ཕུར་མ་རྣམས་དྲུང་དུ་བཞག་པ་ལས།
en: And he put down the elephant’s load of small bags in front of the Buddha.

source: བཅོམ་ལྡན་འདས་ཀྱིས་འབྲས་ཀྱི་ཕུར་མ་རེ་རེ་བླངས་ཤིང་འདི་ཤཱཀྱ་དགའ་བྱེད་ཀྱིའོ། །འདི་ཤཱཀྱ་ཀ་ཡའི་འོ། །འདི་ཤཱཀྱ་འདོད་སྲེད་ཀྱིའོ། །ཞེས་བྱ་བ་ལ་སོགས་པ་འབྲས་ཕུར་མ་རེ་རེ་ལ་ཤཱཀྱ་འདི་ཡིའོ། །ཞེས་མིང་མ་ནོར་བར་རིམ་པར་རྫོགས་པར་གསུངས་པ་ལས།
en: The Blessed One held up each small bag in turn and said, “This one belongs to Śākya Nandaka, this one belongs to Śākya Kaya, this one belongs to Śākya Desire,” and so forth, assigning the appropriate Śākya to each bag of rice and thus unmistakenly, step by step, stating the names till they were finished.

source: བཅོམ་ལྡན་འདས་ཀྱིས་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་ཐམས་ཅད་གཟིགས་པ་ལ་ཤཱཀྱ་མིང་ཆེན་ལ་སོགས་པ་ཐམས་ཅད་ཡིད་ཆེས་ཏེ།
en: With this, Śākya Mahānāman and the others were all convinced that the Blessed One’s buddha-eye saw all things.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་འཕོས་པ་ཅིར་འགྱུར་བ་བཤད་པ་ནི་ངེས་སོ་སྙམ་ནས། བཅོམ་ལྡན་འདས་ལ་བསྟོད་པ།
en: They thought that the Blessed One’s explanation about death was surely right and commended him as follows:

source: སངས་རྒྱས་སྤྱན་གྱིས་ཐམས་ཅད་གཟིགས། །
en: “With his buddha-eye, he sees all.

source: འཇིག་རྟེན་པ་ལྟར་བརྫུན་མི་མངའ། །
en: Unlike the worldly, he does not lie.

source: ཤཱ་ཀྱའི་གྲོང་ཁྱེར་ཇི་སྙེད་པའི། །འབྲས་ཀྱི་ཕུར་མ་མ་ནོར་མཁྱེན། །
en: He unmistakenly knows the small bags of rice Of everyone in Kapilavastu.

source: སེམས་ཅན་ཚེ་འཕོས་ཕ་རོལ་ན། །ཇི་ལྟར་སྣང་བ་འཇིག་རྟེན་བརྫུན། །
en: “The world lies about beings’ deaths And how they appear in the beyond.

source: བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་མད། །
en: The Blessed One has spoken truly.

source: ཀུན་གཟིགས་ཁྱོད་ལ་ཕྱག་འཚལ་བསྟོད། །
en: Praise and homage to you who sees all.”

source: ཅེས་བསྟོད་ནས་སྤོབས་པ་མེད་དེ་མི་སྨྲ་བར་འདུག་གོ། །
en: They were at a loss for words after offering such praises, and thus remained silent.

source: དེ་ནས་ཡབ་རྒྱལ་པོ་ཆེན་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The father, the Great King, then spoke.
